ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/чартер_Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_Рейсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКвотаНаОрганизацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПерелета</name>
    <type>
      <types>CatalogRef.чартер_МаршрутыПерелета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПолета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортРейсаЗагружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БортСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квотирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.чартер_Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КвотаНаРейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Enums/чартер_ТипВСРассадка/чартер_ТипВСРассадка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>чартер_ТипВСРассадка</name>
  <enumValues>
    <name>Boeing763_290PAX</name>
  </enumValues>
  <enumValues>
    <name>Boeing763_235PAX</name>
  </enumValues>
  <enumValues>
    <name>Boeing763_189PAX</name>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	КоличествоМест = 290;
	ТипВС = Перечисления.чартер_ТипВСРассадка.Boeing763_290PAX;
	Багаж = 30;
	
	ЗаполнитьКвотированиеРейса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьКвотированиеРейса() Экспорт
	
	Квотирование.Очистить();
	
	ПараметрыКвотирования = Новый Структура;
	ПараметрыКвотирования.Вставить("ДатаРейса", ДатаРейса); 
	ПараметрыКвотирования.Вставить("ТипВС", ТипВС);
	
	КвотыЗаПериод = РегистрыСведений.чартер_КвотированиеОрганизацийНаРейс.ПолучитьКвотыЗаПериод(ПараметрыКвотирования);
	
	Если Не КвотыЗаПериод = Неопределено Тогда

		Выборка = КвотыЗаПериод.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Квотирование.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;			
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
